disease_info = {

    "Healthy": {
        "name_th": "ใบข้าวปกติ",

        "description":
            "ไม่พบลักษณะอาการของโรคที่สำคัญบนใบข้าว",

        "management": [
            "ดูแลน้ำและธาตุอาหารให้เหมาะสม",
            "สำรวจแปลงอย่างสม่ำเสมอ",
            "รักษาความสะอาดของแปลง"
        ]
    },

    "Bacterial Leaf Blight": {
        "name_th": "โรคขอบใบแห้ง",

        "description":
            "มักพบแผลสีเหลืองถึงน้ำตาลบริเวณใบ "
            "และอาจลุกลามตามแนวใบ",

        "management": [
            "ใช้พันธุ์ข้าวที่ต้านทาน เช่น พันธุ์สุพรรณบุรี 60 สุพรรณบุรี 90 สุพรรณบุรี 1 สุพรรณบุรี 2 กข7 และ กข23",
            "ในดินที่อุดมสมบูรณ์ไม่ควรใส่ปุ๋ยไนโตรเจนมาก",
            "ไม่ควรระบายน้ำจากแปลงที่เป็นโรคไปสู่แปลงอื่น",
            "ควรเฝ้าระวังการเกิดโรคถ้าปลูกข้าวพันธุ์ที่อ่อนแอต่อโรคนี้ เช่น พันธุ์ขาวดอกมะลิ 105 กข6 เหนียวสันป่าตอง พิษณุโลก 2  ชัยนาท 1 เมื่อเริ่มพบอาการของโรคบนใบข้าว ให้ใช้สารป้องกันกำจัดโรคพืช เช่น ไอโซโพรไทโอเลน คอปเปอร์ไฮดรอกไซด์ เสตร็พโตมัยซินซัลเฟต+ออกซีเตทตราไซคลินไฮโดรคลอร์ไรด์ ไตรเบซิคคอปเปอร์ซัลเฟต"
        ]
    },

    "Brown Spot": {
        "name_th": "โรคใบจุดสีน้ำตาล",

        "description":
            "พบจุดหรือแผลสีน้ำตาลบนใบข้าว "
            "โดยอาจมีขอบสีเข้ม",

        "management": [
            "ใช้พันธุ์ต้านทานที่เหมาะสมกับสภาพท้องที่ และโดยเฉพาะพันธุ์ที่มีคุณสมบัติต้านทานโรคใบสีส้ม เช่น ภาคกลางใช้พันธุ์ปทุมธานี 1 ภาคเหนือและภาคตะวันออกเฉียงเหนือ ใช้พันธุ์เหนียวสันป่าตอง และหางยี 71",
            "ปรับปรุงดินโดยการไถกลบฟาง หรือเพิ่มความอุดมสมบูรณ์ดินโดยการปลูกพืชปุ๋ยสด หรือปลูกพืชหมุนเวียนเพื่อช่วยลดความรุนแรงของโรค",
            "คลุกเมล็ดพันธุ์ก่อนปลูกด้วยสารป้องกันกำจัดเชื้อรา เช่น แมนโคเซ็บ หรือคาร์เบนดาซิม+แมนโคเซ็บอัตรา 3 กรัม / เมล็ด 1 กิโลกรัม ใส่ปุ๋ยโปแตสเซียมคลอไรด์ (0-0-60) อัตรา 5-10 กิโลกรัม / ไร่ ช่วยลดความรุนแรงของโรค",
            "กำจัดวัชพืชในนา ดูแลแปลงให้สะอาด และใส่ปุ๋ยในอัตราที่เหมาะสม",
	    "ถ้าพบอาการของโรคใบจุดสีน้ำตาลรุนแรงทั่วไป 10 เปอร์เซ็นต์ของพื้นที่ใบในระยะข้าวแตกกอ หรือในระยะที่ต้นข้าวตั้งท้องใกล้ออกรวง เมื่อพบอาการใบจุดสีน้ำตาลที่ใบธงในสภาพฝนตกต่อเนื่อง อาจทำให้เกิดโรคเมล็ดด่าง ควรพ่นด้วยสารป้องกันกำจัดเชื้อรา เช่น คาร์เบนดาซิม แมนโคเซ็บ โพรพิโคนาโซล ทีบูโคโนโซล ครีโซซิม-เมทิล หรือ คาร์เบนดาซิม+แมนโคเซบ ตามอัตราที่ระบุ"
        ]
    },

    "Leaf Blast": {
        "name_th": "โรคใบไหม้",

        "description":
            "มักพบแผลบนใบที่มีลักษณะคล้ายรูปกระสวย "
            "หรือรูปเพชร",

        "management": [
            "ใช้พันธุ์ค่อนข้างต้านทานโรค ภาคกลาง เช่น สุพรรณบุรี 1 สุพรรณบุรี 60 ปราจีนบุรี 1 พลายงาม ข้าวเจ้าหอมพิษณุโลก 1, ภาคเหนือ และตะวันออกเฉียงเหนือ เช่น ข้าวเจ้าหอมพิษณุโลก 1 สุรินทร์ 1 เหนียวอุบล 2 สันปาตอง 1 หางยี 71 กู้เมืองหลวง ขาวโป่งไคร้ น้ำรู ภาคใต้ เช่น ",
            "หว่านเมล็ดพันธุ์ในอัตราที่เหมาะสม คือ 15-20 กิโลกรัม/ไร่ ควรแบ่งแปลงให้มีการระบายถ่ายเทอากาศดี และไม่ควรใส่ปุ๋ยไนโตรเจนสูงเกินไป ถ้าสูงถึง 50 กิโลกรัม/ไร่ โรคไหม้จะพัฒนาอย่างรวดเร็ว",
            "คลุกเมล็ดพันธุ์ด้วยสารป้องกันกำจัดเชื้อรา เช่น ไตรไซคลาโซล (tricyclazone) คาซูกาไมซิน (kasugamycin) คาร์เบนดาซิม (carbendazim) โพรคลอราซ ตามอัตราที่ระบุ",
            "ในแหล่งที่เคยมีโรคระบาดและพบแผลโรคไหม้ทั่วไป 5 เปอร์เซ็นต์ ของพื้นที่ใบ (ในภาพรวม พบเฉลี่ย 2-3 แผลต่อใบ) ควรฉีดพ่นสารป้องกันกำจัดเชื้อรา เช่น ไตรไซคลาโซล (tricyclazone) คาซูกาไมซิน (kasugamycin) อีดิเฟนฟอส ไอโซโพรไทโอเลน (isoprothiolane) คาร์เบนดาซิม (carbendazim) ตามอัตราที่ระบุ"
        ]
    },

    "Leaf Scald": {
        "name_th": "โรคใบวงสีน้ำตาล",

        "description":
            "พบแผลสีน้ำตาลหรือบริเวณใบที่มีลักษณะคล้ายถูกลวก",

        "management": [
            "ใช้พันธุ์ข้าวต้านทาน เช่น ในภาคตะวันออกเฉียงเหนือใช้ หางยี 71",
            "กำจัดพืชอาศัยของเชื้อราสาเหตุโรค",
            "ในแหล่งที่เคยมีโรคระบาด หรือพบแผลลักษณะอาการดังที่กล่าวข้างต้นบนใบข้าวจำนวนมาก ในระยะข้าวแตกกอ ควรฉีดพ่นสารป้องกันกำจัดโรคพืช เช่น ไธโอฟาเนทเมทิล โพรพิโคนาโซล ตามอัตราที่ระบุ",
	    "ในแหล่งที่เคยมีโรคระบาดและพบแผลโรคไหม้ทั่วไป 5 เปอร์เซ็นต์ ของพื้นที่ใบ (ในภาพรวม พบเฉลี่ย 2-3 แผลต่อใบ) ควรฉีดพ่นสารป้องกันกำจัดเชื้อรา เช่น ไตรไซคลาโซล (tricyclazone) คาซูกาไมซิน (kasugamycin) อีดิเฟนฟอส ไอโซโพรไทโอเลน (isoprothiolane) คาร์เบนดาซิม (carbendazim) ตามอัตราที่ระบุ"
        ]
    },

    "Tungro": {
        "name_th": "โรคใบสีส้ม",

        "description":
            "ต้นข้าวอาจมีอาการแคระแกร็น "
            "และใบเปลี่ยนเป็นสีเหลืองถึงสีส้ม",

        "management": [
            "ใช้พันธุ์ข้าวต้านทานแมลงเพลี้ยจักจั่นสีเขียว เช่น กข1 กข3",
            "กำจัดวัชพืช และพืชอาศัยของเชื้อไวรัสและแมลงพาหะนำโรค",
            "ใช้สารป้องกันกำจัดแมลงพาหะ ได้แก่ ใช้สารฆ่าแมลงในระยะที่แมลงเป็นตัวอ่อน เช่น ไดโนทีฟูเรน หรือ บูโพรเฟซิน หรือ อีโทเฟนพรอกซ์ ไม่ควรใช้สารฆ่าแมลงผสมกันหลายๆ ชนิด หรือใช้สารฆ่าแมลงผสมสารกำจัดโรคพืชหรือสารกำจัดวัชพืช เพราะอาจทำให้ประสิทธิภาพของสารฆ่าแมลงลดลง",
            "ไม่ใช้สารกลุ่มไพรีทรอยด์สังเคราะห์ เช่น ไซเพอร์มิทริน ไซฮาโลทริน เดลต้ามิทริน"
        ]
    }
}